Revit 2027 API
BuiltInFailures.DimensionFailures.DimensionUnequaled Property
 Dimension had to be unlocked and un-EQed in order to remove sketch over-constraining.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DimensionUnequaled { get; }
Public Shared ReadOnly Property DimensionUnequaled As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DimensionUnequaled {
	FailureDefinitionId^ get ();
}
static member DimensionUnequaled : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace